In [4]:
import mysql.connector
import pandas as pd

In [6]:
mydb = mysql.connector.connect(
  host="localhost",               #hostname
  user="root",                   # the user who has privilege to the db
  passwd="Sameer@786",               #password for user
  database="company",               #database name
)

In [7]:
query = "select * from employees;"

In [8]:
a = pd.read_sql(query,mydb)
a

C:\Users\Admin\AppData\Local\Temp\ipykernel_14872\1944403643.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  a = pd.read_sql(query,mydb)

,EmployeeID,EmployeeName,Department,Salary,BirthDate,HireDate,ManagerID
0,1,John Doe,IT,65000.0,1990-05-15,2015-02-20,NaN
1,2,Jane Smith,HR,55000.0,1985-08-22,2018-01-10,1.0
2,3,Bob Johnson,Finance,70000.0,1988-12-10,2019-06-15,2.0
3,4,Alice White,IT,60000.0,1995-04-02,2020-03-01,1.0
4,5,Charlie Brown,Finance,80000.0,1980-11-30,2010-07-05,3.0